Coding/Cpp/template_argument_deduction.html
<?xml version="1.0" encoding="gb18030"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>模板参数推导</title>
<meta http-equiv="Content-Type" content="text/html;charset=gb18030"/>
<meta name="title" content="模板参数推导"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-10-19 19:34:04 CST"/>
<meta name="author" content="visaya fan"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>



</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="H" href="../../index.html#cpp"> HOME </a>
</div>


<div id="content">
<h1 class="title">模板参数推导</h1>


<script type="text/javascript" src="https://ajax.googleapis.com/ajax/libs/jquery/1.7.1/jquery.min.js"> </script>
<link rel="stylesheet" type="text/css" href="../../Layout/CSS/vf.css" />
<script src="../../Layout/JS/bootstrap_old.js"></script>


<div id="table-of-contents">
<h2>TOC</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 模板参数推导在迭代器中的使用</a></li>
<li><a href="#sec-2">2 模板参数引用与非引用的区别</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> 模板参数推导在迭代器中的使用</h2>
<div class="outline-text-2" id="text-1">

<p>在算法中运用迭代器时，可能会用到其相应类型（associative type），即迭代器所指向对象的类别。但C++只支持sizeof()，并不存在typeof()之说（即使运用RTTI性质中的typeid()获得的也只是类型名称不能用来做变量声明之用）。<br/>
为解决此问题，可以利用函数模板（function template）的参数推导（argument deduction）机制：<br/>
</p>
<p><br/>
<pre class="src src-c++"><span style="color: #a020f0;">template</span> &lt;<span style="color: #a020f0;">class</span> <span style="color: #228b22;">I</span>, <span style="color: #a020f0;">class</span> <span style="color: #228b22;">T</span>&gt;
<span style="color: #228b22;">void</span> <span style="color: #0000ff;">fun_impl</span>(<span style="color: #228b22;">I</span> <span style="color: #a0522d;">iter</span>, <span style="color: #228b22;">T</span> <span style="color: #a0522d;">t</span>){     <span style="color: #b22222;">// </span><span style="color: #b22222;">&#27492;&#22788;&#35813;&#20989;&#25968;&#21033;&#29992;&#27169;&#26495;&#21442;&#25968;&#25512;&#23548;&#24471;&#30693;T&#20026;*iter&#31867;&#22411;</span>
    <span style="color: #228b22;">T</span> <span style="color: #a0522d;">tmp</span>;                      <span style="color: #b22222;">// </span><span style="color: #b22222;">&#21487;&#20197;&#22768;&#26126;&#21464;&#37327;</span>
    <span style="color: #b22222;">//</span><span style="color: #b22222;">...</span>
};

<span style="color: #a020f0;">template</span> &lt;<span style="color: #a020f0;">class</span> <span style="color: #228b22;">I</span>&gt;
<span style="color: #a020f0;">inline</span> <span style="color: #228b22;">void</span> <span style="color: #0000ff;">fun</span>(<span style="color: #228b22;">I</span> <span style="color: #a0522d;">iter</span>){
    fun_impl(iter, *iter); <span style="color: #b22222;">//</span><span style="color: #b22222;">&#27492;&#22788;&#25226;*iter&#20316;&#20026;&#31532;&#20108;&#20010;&#21442;&#25968;&#20256;&#36882;&#32473;fun_impl()</span>
}
<span style="color: #228b22;">int</span> <span style="color: #0000ff;">main</span>(<span style="color: #228b22;">int</span> <span style="color: #a0522d;">argc</span>, <span style="color: #228b22;">char</span> *<span style="color: #a0522d;">argv</span>[])
{
    <span style="color: #228b22;">int</span> <span style="color: #a0522d;">i</span>;
    fun(&amp;i);
    <span style="color: #a020f0;">return</span> 0;
}
</pre>


再例如：<br/>
</p>
<p><br/>
<pre class="src src-c++"><span style="color: #a020f0;">template</span>&lt;<span style="color: #a020f0;">class</span> <span style="color: #228b22;">I</span>, <span style="color: #a020f0;">class</span> <span style="color: #228b22;">Cmp</span>&gt;  
<span style="color: #228b22;">void</span> <span style="color: #0000ff;">insertSort</span>(<span style="color: #a020f0;">const</span> <span style="color: #228b22;">I</span>&amp; <span style="color: #a0522d;">begin</span>, <span style="color: #a020f0;">const</span> <span style="color: #228b22;">I</span>&amp; <span style="color: #a0522d;">end</span>, <span style="color: #228b22;">Cmp</span> <span style="color: #a0522d;">lessThan</span>);  

<span style="color: #a020f0;">template</span> &lt;<span style="color: #a020f0;">class</span> <span style="color: #228b22;">I</span>, <span style="color: #a020f0;">class</span> <span style="color: #228b22;">T</span>&gt;  
<span style="color: #228b22;">void</span> <span style="color: #0000ff;">_insertSort</span>(<span style="color: #a020f0;">const</span> <span style="color: #228b22;">I</span>&amp; <span style="color: #a0522d;">begin</span>, <span style="color: #a020f0;">const</span> <span style="color: #228b22;">I</span>&amp; <span style="color: #a0522d;">end</span>, <span style="color: #a020f0;">const</span> <span style="color: #228b22;">T</span> <span style="color: #a0522d;">t</span>);  

<span style="color: #a020f0;">template</span>&lt;<span style="color: #a020f0;">class</span> <span style="color: #228b22;">I</span>, <span style="color: #a020f0;">class</span> <span style="color: #228b22;">T</span>, <span style="color: #a020f0;">class</span> <span style="color: #228b22;">Cmp</span>&gt;  
<span style="color: #228b22;">void</span> <span style="color: #0000ff;">_insertSort</span>(<span style="color: #a020f0;">const</span> <span style="color: #228b22;">I</span>&amp; <span style="color: #a0522d;">begin</span>, <span style="color: #a020f0;">const</span> <span style="color: #228b22;">I</span>&amp; <span style="color: #a0522d;">end</span>, <span style="color: #228b22;">Cmp</span> <span style="color: #a0522d;">lessThan</span>, <span style="color: #a020f0;">const</span> <span style="color: #228b22;">T</span>&amp; <span style="color: #a0522d;">t</span>);  

<span style="color: #a020f0;">template</span> &lt;<span style="color: #a020f0;">class</span> <span style="color: #228b22;">I</span>&gt;  
<span style="color: #228b22;">void</span> <span style="color: #0000ff;">insertSort</span>(<span style="color: #a020f0;">const</span> <span style="color: #228b22;">I</span>&amp; <span style="color: #a0522d;">begin</span>, <span style="color: #a020f0;">const</span> <span style="color: #228b22;">I</span>&amp; <span style="color: #a0522d;">end</span>){  
    <span style="color: #a020f0;">if</span>(begin != end)  
        _insertSort(begin, end, *begin); <span style="color: #b22222;">// </span><span style="color: #b22222;">&#25226;*begin&#20256;&#36882;&#20570;&#20026;&#31532;&#19977;&#20010;&#21442;&#25968;</span>
}  

<span style="color: #a020f0;">template</span> &lt;<span style="color: #a020f0;">class</span> <span style="color: #228b22;">I</span>, <span style="color: #a020f0;">class</span> <span style="color: #228b22;">T</span>&gt;  
<span style="color: #b22222;">// </span><span style="color: #b22222;">&#27492;&#26102;__insertSort&#21033;&#29992;&#27169;&#26495;&#21442;&#25968;&#25512;&#23548;&#26426;&#21046;&#25512;&#27979;&#20986;T&#30340;&#31867;&#22411;&#65292;&#20854;&#23454;&#23601;&#26159;&#19978;&#20010;&#20989;&#25968;insertSort(const I&amp; begin, const I&amp; end)&#20013;&#36845;&#20195;&#22120;begin&#25152;&#25351;&#21521;&#23545;&#35937;&#30340;&#31867;&#22411;</span>
<span style="color: #228b22;">void</span> <span style="color: #0000ff;">_insertSort</span>(<span style="color: #a020f0;">const</span> <span style="color: #228b22;">I</span>&amp; <span style="color: #a0522d;">begin</span>, <span style="color: #a020f0;">const</span> <span style="color: #228b22;">I</span>&amp; <span style="color: #a0522d;">end</span>, <span style="color: #a020f0;">const</span> <span style="color: #228b22;">T</span> <span style="color: #a0522d;">t</span>){ 
    insertSort(begin, end, <span style="color: #228b22;">less</span>&lt;<span style="color: #228b22;">T</span>&gt;());                     <span style="color: #b22222;">//</span><span style="color: #b22222;">&#27492;&#26102;T&#24050;&#34987;&#25512;&#27979;&#20986;&#26469;&#21487;&#20197;&#30452;&#25509;&#20351;&#29992;</span>
}  

<span style="color: #a020f0;">template</span>&lt;<span style="color: #a020f0;">class</span> <span style="color: #228b22;">I</span>, <span style="color: #a020f0;">class</span> <span style="color: #228b22;">Cmp</span>&gt;  
<span style="color: #228b22;">void</span> <span style="color: #0000ff;">insertSort</span>(<span style="color: #a020f0;">const</span> <span style="color: #228b22;">I</span>&amp; <span style="color: #a0522d;">begin</span>, <span style="color: #a020f0;">const</span> <span style="color: #228b22;">I</span>&amp; <span style="color: #a0522d;">end</span>, <span style="color: #228b22;">Cmp</span> <span style="color: #a0522d;">lessThan</span>){  
    <span style="color: #a020f0;">if</span>(begin != end)  
        _insertSort(begin, end, lessThan, *begin);
}  

<span style="color: #b22222;">//</span><span style="color: #b22222;">&#31639;&#27861;&#30340;&#20855;&#20307;&#23454;&#29616;  </span>
<span style="color: #a020f0;">template</span>&lt;<span style="color: #a020f0;">class</span> <span style="color: #228b22;">I</span>, <span style="color: #a020f0;">class</span> <span style="color: #228b22;">T</span>, <span style="color: #a020f0;">class</span> <span style="color: #228b22;">Cmp</span>&gt;  
<span style="color: #228b22;">void</span> <span style="color: #0000ff;">_insertSort</span>(<span style="color: #a020f0;">const</span> <span style="color: #228b22;">I</span>&amp; <span style="color: #a0522d;">begin</span>, <span style="color: #a020f0;">const</span> <span style="color: #228b22;">I</span>&amp; <span style="color: #a0522d;">end</span>, <span style="color: #228b22;">Cmp</span> <span style="color: #a0522d;">lessThan</span>, <span style="color: #a020f0;">const</span> <span style="color: #228b22;">T</span>&amp; <span style="color: #a0522d;">t</span>){  
    <span style="color: #228b22;">I</span> <span style="color: #a0522d;">j</span>;  
    <span style="color: #a020f0;">for</span>(<span style="color: #228b22;">I</span> <span style="color: #a0522d;">i</span> = begin+1; i != end; ++i){  
        <span style="color: #228b22;">T</span> <span style="color: #a0522d;">tmp</span> = *i; <span style="color: #b22222;">//</span><span style="color: #b22222;">&#36890;&#36807;&#21442;&#25968;&#25512;&#23548;&#30830;&#23450;T&#31867;&#22411;  </span>
        <span style="color: #a020f0;">for</span>(j = i; j != begin &amp;&amp; lessThan(tmp, *(j-1)); --j)  
            *j = *(j-1);  
        *j = tmp;  
    }  
}
</pre>


参数为两个迭代器的函数insertSort把其中一个迭代器解引用后传递给参数为两个迭代器和一个迭代器指向对象类型的三个参数的__insertSort函数，用户并不关心底层如何实现，只需要传递两个参数即可，并未告知函数迭代器指向对象的类型但可以通过模板参数推导机制来推测，从而方便用户。<br/>
</p></div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> 模板参数引用与非引用的区别</h2>
<div class="outline-text-2" id="text-2">

<p>  当模板参数是非引用时会导致模板参数推断衰减(decaying)(把数组和函数类型变成指针类型、去掉const, volatile等修饰符)。<br/>
  例如：<br/>
</p>
<p><br/>
<pre class="src src-c++"><span style="color: #a020f0;">template</span>&lt;<span style="color: #a020f0;">typename</span> <span style="color: #228b22;">T</span>&gt; <span style="color: #228b22;">void</span> <span style="color: #0000ff;">f</span>(<span style="color: #228b22;">T</span>);    <span style="color: #b22222;">//</span><span style="color: #b22222;">PisT </span>

<span style="color: #a020f0;">template</span>&lt;<span style="color: #a020f0;">typename</span> <span style="color: #228b22;">T</span>&gt; <span style="color: #228b22;">void</span> <span style="color: #0000ff;">g</span>(<span style="color: #228b22;">T</span>&amp;);  <span style="color: #b22222;">// </span><span style="color: #b22222;">P is also T </span>

<span style="color: #228b22;">double</span> <span style="color: #a0522d;">x</span>[20]; 

<span style="color: #228b22;">int</span> <span style="color: #a020f0;">const</span> <span style="color: #a0522d;">seven</span> = 7; 

f(x);      <span style="color: #b22222;">// </span><span style="color: #b22222;">nonreference parameter: T is double* </span>
g(x);      <span style="color: #b22222;">// </span><span style="color: #b22222;">reference parameter:    T is double[20] </span>
f(seven);  <span style="color: #b22222;">// </span><span style="color: #b22222;">nonreference parameter: T is int </span>
g(seven);  <span style="color: #b22222;">// </span><span style="color: #b22222;">reference parameter:    T is int const </span>
f(7);      <span style="color: #b22222;">// </span><span style="color: #b22222;">nonreference parameter: T is int </span>
g(7);      <span style="color: #b22222;">// </span><span style="color: #b22222;">reference parameter:    T is int =&gt; ERROR: can't pass 7 to int&amp; </span>
</pre>

  f是非引用模板参数，所以会decaying 把double[]变成double*，同理int const =&gt; int，最后一个传递是非法的，因为不能把常数作为int&amp;。<br/>
</p>
<p>  <br/>
  再例如：<br/>
</p>
<p><br/>
<pre class="src src-c++"><span style="color: #7a378b;">#include</span> <span style="color: #8b2252;">&lt;iostream&gt;</span>
<span style="color: #7a378b;">#include</span> <span style="color: #8b2252;">&lt;typeinfo&gt;</span>
<span style="color: #a020f0;">using</span> <span style="color: #a020f0;">namespace</span> <span style="color: #008b8b;">std</span>;

<span style="color: #a020f0;">template</span> &lt;<span style="color: #a020f0;">typename</span> <span style="color: #228b22;">T</span>&gt;
<span style="color: #a020f0;">inline</span> <span style="color: #a020f0;">const</span> <span style="color: #228b22;">T</span>&amp; <span style="color: #0000ff;">Max</span>(<span style="color: #a020f0;">const</span> <span style="color: #228b22;">T</span>&amp; <span style="color: #a0522d;">a</span>, <span style="color: #a020f0;">const</span> <span style="color: #228b22;">T</span>&amp; <span style="color: #a0522d;">b</span>){
    <span style="color: #a020f0;">return</span> a&lt;b?b:a;
}

<span style="color: #a020f0;">template</span> &lt;<span style="color: #a020f0;">typename</span> <span style="color: #228b22;">T</span>&gt;
<span style="color: #a020f0;">inline</span> <span style="color: #228b22;">T</span> <span style="color: #0000ff;">MMax</span>(<span style="color: #228b22;">T</span> <span style="color: #a0522d;">a</span>, <span style="color: #228b22;">T</span> <span style="color: #a0522d;">b</span>){
    <span style="color: #a020f0;">return</span> a&lt;b?b:a;
}

<span style="color: #a020f0;">template</span> &lt;<span style="color: #a020f0;">typename</span> <span style="color: #228b22;">T</span>&gt;
<span style="color: #228b22;">void</span> <span style="color: #0000ff;">ref</span>(<span style="color: #a020f0;">const</span> <span style="color: #228b22;">T</span>&amp; <span style="color: #a0522d;">t</span>){
    cout&lt;&lt;<span style="color: #8b2252;">"Ref: "</span>&lt;&lt;<span style="color: #a020f0;">typeid</span>(t).name()&lt;&lt;endl;
}

<span style="color: #a020f0;">template</span> &lt;<span style="color: #a020f0;">typename</span> <span style="color: #228b22;">T</span>&gt;
<span style="color: #228b22;">void</span> <span style="color: #0000ff;">nonref</span>(<span style="color: #228b22;">T</span> <span style="color: #a0522d;">t</span>){
    cout&lt;&lt;<span style="color: #8b2252;">"Nonref: "</span>&lt;&lt;<span style="color: #a020f0;">typeid</span>(t).name()&lt;&lt;endl;
}

<span style="color: #228b22;">int</span> <span style="color: #0000ff;">main</span>(<span style="color: #228b22;">int</span> <span style="color: #a0522d;">argc</span>, <span style="color: #228b22;">char</span> *<span style="color: #a0522d;">argv</span>[])
{
    ref(<span style="color: #8b2252;">"hello"</span>);               <span style="color: #b22222;">// </span><span style="color: #b22222;">const char [6]</span>
    nonref(<span style="color: #8b2252;">"hello"</span>);            <span style="color: #b22222;">// </span><span style="color: #b22222;">const char *</span>
    Max(<span style="color: #8b2252;">"abcd"</span>, <span style="color: #8b2252;">"cdef"</span>);        <span style="color: #b22222;">// </span><span style="color: #b22222;">&#37117;&#26159;const char [4]&#31867;&#22411;</span>
    <span style="color: #b22222;">// </span><span style="color: #b22222;">Max("abc", "abcde");     //error &#21069;&#32773;const char [3]&#65292;&#21518;&#32773;const char [5]&#65292;&#19981;&#19968;&#33268;&#65292;&#25152;&#20197;&#20986;&#38169;&#12290;</span>
    MMax(<span style="color: #8b2252;">"abc"</span>, <span style="color: #8b2252;">"abcde"</span>);       <span style="color: #b22222;">// </span><span style="color: #b22222;">&#37117;&#26159;const char *&#31867;&#22411;&#65292;&#21305;&#37197;&#25152;&#20197;&#21487;&#20197;&#36816;&#34892;</span>
    Max(1, 1.1);
    <span style="color: #a020f0;">return</span> 0;
}
</pre>


<script src="../../Layout/JS/disqus-comment.js"></script>
<div id="disqus_thread">
</div>
</p></div>
</div>
</div>

</body>
</html>
